#Количество шагов за последнюю неделю
steps = [1513, 5035, 7891, 1212, 2534, 4648, 3785]

#Создать срез для последних 3 дней
last_3 = steps[-3:]

#Вывести срез
print(last_3)